# CLI Tools
brew "zsh" unless File.exist?("/bin/zsh")
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "zoxide"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "jq"
brew "htop"
brew "stow"
brew "tree"
brew "shellcheck"
brew "just"
brew "mise"

# Terminal & Multiplexer
brew "tmux"
brew "tpm"

# Editor
brew "neovim"

# Git
brew "git"
brew "gh"
brew "lazygit"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# GUI Apps
cask "ghostty"
cask "visual-studio-code"
cask "raycast"
